; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l31_p31_c31_g31)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 refugio20 refugio21 refugio22 refugio23 refugio24 refugio25 refugio26 refugio27 refugio28 refugio29 refugio30 refugio31 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 person20 person21 person22 person23 person24 person25 person26 person27 person28 person29 person30 person31 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 comida)
	(at-box box13 deposito)
	(box-has box13 comida)
	(at-box box14 deposito)
	(box-has box14 comida)
	(at-box box15 deposito)
	(box-has box15 comida)
	(at-box box16 deposito)
	(box-has box16 comida)
	(at-box box17 deposito)
	(box-has box17 comida)
	(at-box box18 deposito)
	(box-has box18 medicina)
	(at-box box19 deposito)
	(box-has box19 medicina)
	(at-box box20 deposito)
	(box-has box20 medicina)
	(at-box box21 deposito)
	(box-has box21 medicina)
	(at-box box22 deposito)
	(box-has box22 medicina)
	(at-box box23 deposito)
	(box-has box23 medicina)
	(at-box box24 deposito)
	(box-has box24 medicina)
	(at-box box25 deposito)
	(box-has box25 medicina)
	(at-box box26 deposito)
	(box-has box26 medicina)
	(at-box box27 deposito)
	(box-has box27 medicina)
	(at-box box28 deposito)
	(box-has box28 medicina)
	(at-box box29 deposito)
	(box-has box29 medicina)
	(at-box box30 deposito)
	(box-has box30 medicina)
	(at-box box31 deposito)
	(box-has box31 medicina)
	(at-person person1 refugio17)
	(at-person person2 refugio15)
	(at-person person3 refugio12)
	(at-person person4 refugio8)
	(at-person person5 refugio11)
	(at-person person6 refugio9)
	(at-person person7 refugio20)
	(at-person person8 refugio16)
	(at-person person9 refugio14)
	(at-person person10 refugio2)
	(at-person person11 refugio24)
	(at-person person12 refugio3)
	(at-person person13 refugio18)
	(at-person person14 refugio4)
	(at-person person15 refugio15)
	(at-person person16 refugio14)
	(at-person person17 refugio5)
	(at-person person18 refugio16)
	(at-person person19 refugio11)
	(at-person person20 refugio6)
	(at-person person21 refugio4)
	(at-person person22 refugio29)
	(at-person person23 refugio25)
	(at-person person24 refugio9)
	(at-person person25 refugio6)
	(at-person person26 refugio5)
	(at-person person27 refugio14)
	(at-person person28 refugio11)
	(at-person person29 refugio17)
	(at-person person30 refugio3)
	(at-person person31 refugio31)
)

(:goal (and
	(person-has person2 comida)
	(person-has person3 comida)
	(person-has person3 medicina)
	(person-has person4 comida)
	(person-has person5 medicina)
	(person-has person6 comida)
	(person-has person7 medicina)
	(person-has person8 comida)
	(person-has person9 comida)
	(person-has person10 comida)
	(person-has person11 medicina)
	(person-has person13 comida)
	(person-has person13 medicina)
	(person-has person15 medicina)
	(person-has person17 medicina)
	(person-has person19 comida)
	(person-has person19 medicina)
	(person-has person20 comida)
	(person-has person20 medicina)
	(person-has person21 comida)
	(person-has person21 medicina)
	(person-has person22 comida)
	(person-has person23 medicina)
	(person-has person24 comida)
	(person-has person25 comida)
	(person-has person26 comida)
	(person-has person26 medicina)
	(person-has person27 comida)
	(person-has person27 medicina)
	(person-has person29 comida)
	(person-has person29 medicina)
))
)

; plan
1. (pick box17 deposito dron1-der dron1)
   deleted: (at-box box17 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box17)
   goals met: 0 of 31
2. (pick box31 deposito dron1-izq dron1)
   deleted: (at-box box31 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box31)
   goals met: 0 of 31
3. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 0 of 31
4. (move refugio12 refugio8 dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 refugio8)
   goals met: 0 of 31
5. (leave box17 refugio8 dron1-der dron1 person4 comida)
   deleted: (carrying dron1 dron1-der box17) (box-has box17 comida)
   added: (at-box box17 refugio8) (free dron1-der) (person-has person4 comida)
   goals met: 1 of 31
6. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 1 of 31
7. (pick box16 deposito dron1-der dron1)
   deleted: (at-box box16 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box16)
   goals met: 1 of 31
8. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 1 of 31
9. (move refugio12 refugio20 dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 refugio20)
   goals met: 1 of 31
10. (leave box31 refugio20 dron1-izq dron1 person7 medicina)
   deleted: (carrying dron1 dron1-izq box31) (box-has box31 medicina)
   added: (at-box box31 refugio20) (free dron1-izq) (person-has person7 medicina)
   goals met: 2 of 31
11. (move refugio20 deposito dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 deposito)
   goals met: 2 of 31
12. (pick box30 deposito dron1-izq dron1)
   deleted: (at-box box30 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box30)
   goals met: 2 of 31
13. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 2 of 31
14. (move refugio12 refugio16 dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 refugio16)
   goals met: 2 of 31
15. (leave box16 refugio16 dron1-der dron1 person8 comida)
   deleted: (carrying dron1 dron1-der box16) (box-has box16 comida)
   added: (at-box box16 refugio16) (free dron1-der) (person-has person8 comida)
   goals met: 3 of 31
16. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 3 of 31
17. (pick box15 deposito dron1-der dron1)
   deleted: (at-box box15 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box15)
   goals met: 3 of 31
18. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 3 of 31
19. (move refugio12 refugio2 dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 refugio2)
   goals met: 3 of 31
20. (leave box15 refugio2 dron1-der dron1 person10 comida)
   deleted: (carrying dron1 dron1-der box15) (box-has box15 comida)
   added: (at-box box15 refugio2) (free dron1-der) (person-has person10 comida)
   goals met: 4 of 31
21. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 4 of 31
22. (pick box14 deposito dron1-der dron1)
   deleted: (at-box box14 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box14)
   goals met: 4 of 31
23. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 4 of 31
24. (move refugio12 refugio24 dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 refugio24)
   goals met: 4 of 31
25. (leave box30 refugio24 dron1-izq dron1 person11 medicina)
   deleted: (carrying dron1 dron1-izq box30) (box-has box30 medicina)
   added: (at-box box30 refugio24) (free dron1-izq) (person-has person11 medicina)
   goals met: 5 of 31
26. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 5 of 31
27. (pick box29 deposito dron1-izq dron1)
   deleted: (at-box box29 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box29)
   goals met: 5 of 31
28. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 5 of 31
29. (move refugio12 refugio29 dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 refugio29)
   goals met: 5 of 31
30. (leave box14 refugio29 dron1-der dron1 person22 comida)
   deleted: (carrying dron1 dron1-der box14) (box-has box14 comida)
   added: (at-box box14 refugio29) (free dron1-der) (person-has person22 comida)
   goals met: 6 of 31
31. (move refugio29 deposito dron1)
   deleted: (at-dron dron1 refugio29)
   added: (at-dron dron1 deposito)
   goals met: 6 of 31
32. (pick box13 deposito dron1-der dron1)
   deleted: (at-box box13 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box13)
   goals met: 6 of 31
33. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 6 of 31
34. (move refugio12 refugio25 dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 refugio25)
   goals met: 6 of 31
35. (leave box29 refugio25 dron1-izq dron1 person23 medicina)
   deleted: (carrying dron1 dron1-izq box29) (box-has box29 medicina)
   added: (at-box box29 refugio25) (free dron1-izq) (person-has person23 medicina)
   goals met: 7 of 31
36. (move refugio25 deposito dron1)
   deleted: (at-dron dron1 refugio25)
   added: (at-dron dron1 deposito)
   goals met: 7 of 31
37. (pick box28 deposito dron1-izq dron1)
   deleted: (at-box box28 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box28)
   goals met: 7 of 31
38. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 7 of 31
39. (leave box13 refugio12 dron1-der dron1 person3 comida)
   deleted: (carrying dron1 dron1-der box13) (box-has box13 comida)
   added: (at-box box13 refugio12) (free dron1-der) (person-has person3 comida)
   goals met: 8 of 31
40. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 8 of 31
41. (pick box12 deposito dron1-der dron1)
   deleted: (at-box box12 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box12)
   goals met: 8 of 31
42. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 8 of 31
43. (leave box28 refugio12 dron1-izq dron1 person3 medicina)
   deleted: (carrying dron1 dron1-izq box28) (box-has box28 medicina)
   added: (at-box box28 refugio12) (free dron1-izq) (person-has person3 medicina)
   goals met: 9 of 31
44. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 9 of 31
45. (pick box27 deposito dron1-izq dron1)
   deleted: (at-box box27 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box27)
   goals met: 9 of 31
46. (move deposito refugio18 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio18)
   goals met: 9 of 31
47. (leave box12 refugio18 dron1-der dron1 person13 comida)
   deleted: (carrying dron1 dron1-der box12) (box-has box12 comida)
   added: (at-box box12 refugio18) (free dron1-der) (person-has person13 comida)
   goals met: 10 of 31
48. (move refugio18 deposito dron1)
   deleted: (at-dron dron1 refugio18)
   added: (at-dron dron1 deposito)
   goals met: 10 of 31
49. (pick box11 deposito dron1-der dron1)
   deleted: (at-box box11 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box11)
   goals met: 10 of 31
50. (move deposito refugio18 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio18)
   goals met: 10 of 31
51. (leave box27 refugio18 dron1-izq dron1 person13 medicina)
   deleted: (carrying dron1 dron1-izq box27) (box-has box27 medicina)
   added: (at-box box27 refugio18) (free dron1-izq) (person-has person13 medicina)
   goals met: 11 of 31
52. (move refugio18 deposito dron1)
   deleted: (at-dron dron1 refugio18)
   added: (at-dron dron1 deposito)
   goals met: 11 of 31
53. (pick box26 deposito dron1-izq dron1)
   deleted: (at-box box26 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box26)
   goals met: 11 of 31
54. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 11 of 31
55. (leave box11 refugio15 dron1-der dron1 person2 comida)
   deleted: (carrying dron1 dron1-der box11) (box-has box11 comida)
   added: (at-box box11 refugio15) (free dron1-der) (person-has person2 comida)
   goals met: 12 of 31
56. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 12 of 31
57. (pick box10 deposito dron1-der dron1)
   deleted: (at-box box10 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box10)
   goals met: 12 of 31
58. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 12 of 31
59. (leave box26 refugio15 dron1-izq dron1 person15 medicina)
   deleted: (carrying dron1 dron1-izq box26) (box-has box26 medicina)
   added: (at-box box26 refugio15) (free dron1-izq) (person-has person15 medicina)
   goals met: 13 of 31
60. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 13 of 31
61. (pick box25 deposito dron1-izq dron1)
   deleted: (at-box box25 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box25)
   goals met: 13 of 31
62. (move deposito refugio11 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio11)
   goals met: 13 of 31
63. (leave box25 refugio11 dron1-izq dron1 person5 medicina)
   deleted: (carrying dron1 dron1-izq box25) (box-has box25 medicina)
   added: (at-box box25 refugio11) (free dron1-izq) (person-has person5 medicina)
   goals met: 14 of 31
64. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 14 of 31
65. (pick box24 deposito dron1-izq dron1)
   deleted: (at-box box24 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box24)
   goals met: 14 of 31
66. (move deposito refugio11 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio11)
   goals met: 14 of 31
67. (leave box10 refugio11 dron1-der dron1 person19 comida)
   deleted: (carrying dron1 dron1-der box10) (box-has box10 comida)
   added: (at-box box10 refugio11) (free dron1-der) (person-has person19 comida)
   goals met: 15 of 31
68. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 15 of 31
69. (pick box9 deposito dron1-der dron1)
   deleted: (at-box box9 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box9)
   goals met: 15 of 31
70. (move deposito refugio11 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio11)
   goals met: 15 of 31
71. (leave box24 refugio11 dron1-izq dron1 person19 medicina)
   deleted: (carrying dron1 dron1-izq box24) (box-has box24 medicina)
   added: (at-box box24 refugio11) (free dron1-izq) (person-has person19 medicina)
   goals met: 16 of 31
72. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 16 of 31
73. (pick box23 deposito dron1-izq dron1)
   deleted: (at-box box23 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box23)
   goals met: 16 of 31
74. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 16 of 31
75. (leave box9 refugio4 dron1-der dron1 person21 comida)
   deleted: (carrying dron1 dron1-der box9) (box-has box9 comida)
   added: (at-box box9 refugio4) (free dron1-der) (person-has person21 comida)
   goals met: 17 of 31
76. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 17 of 31
77. (pick box8 deposito dron1-der dron1)
   deleted: (at-box box8 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box8)
   goals met: 17 of 31
78. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 17 of 31
79. (leave box23 refugio4 dron1-izq dron1 person21 medicina)
   deleted: (carrying dron1 dron1-izq box23) (box-has box23 medicina)
   added: (at-box box23 refugio4) (free dron1-izq) (person-has person21 medicina)
   goals met: 18 of 31
80. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 18 of 31
81. (pick box22 deposito dron1-izq dron1)
   deleted: (at-box box22 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box22)
   goals met: 18 of 31
82. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 18 of 31
83. (leave box8 refugio9 dron1-der dron1 person6 comida)
   deleted: (carrying dron1 dron1-der box8) (box-has box8 comida)
   added: (at-box box8 refugio9) (free dron1-der) (person-has person6 comida)
   goals met: 19 of 31
84. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 19 of 31
85. (pick box7 deposito dron1-der dron1)
   deleted: (at-box box7 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box7)
   goals met: 19 of 31
86. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 19 of 31
87. (leave box7 refugio9 dron1-der dron1 person24 comida)
   deleted: (carrying dron1 dron1-der box7) (box-has box7 comida)
   added: (at-box box7 refugio9) (free dron1-der) (person-has person24 comida)
   goals met: 20 of 31
88. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 20 of 31
89. (pick box6 deposito dron1-der dron1)
   deleted: (at-box box6 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box6)
   goals met: 20 of 31
90. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 20 of 31
91. (leave box6 refugio6 dron1-der dron1 person20 comida)
   deleted: (carrying dron1 dron1-der box6) (box-has box6 comida)
   added: (at-box box6 refugio6) (free dron1-der) (person-has person20 comida)
   goals met: 21 of 31
92. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 21 of 31
93. (pick box5 deposito dron1-der dron1)
   deleted: (at-box box5 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box5)
   goals met: 21 of 31
94. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 21 of 31
95. (leave box22 refugio6 dron1-izq dron1 person20 medicina)
   deleted: (carrying dron1 dron1-izq box22) (box-has box22 medicina)
   added: (at-box box22 refugio6) (free dron1-izq) (person-has person20 medicina)
   goals met: 22 of 31
96. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 22 of 31
97. (pick box21 deposito dron1-izq dron1)
   deleted: (at-box box21 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box21)
   goals met: 22 of 31
98. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 22 of 31
99. (leave box5 refugio6 dron1-der dron1 person25 comida)
   deleted: (carrying dron1 dron1-der box5) (box-has box5 comida)
   added: (at-box box5 refugio6) (free dron1-der) (person-has person25 comida)
   goals met: 23 of 31
100. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 23 of 31
101. (pick box4 deposito dron1-der dron1)
   deleted: (at-box box4 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box4)
   goals met: 23 of 31
102. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 23 of 31
103. (leave box21 refugio5 dron1-izq dron1 person17 medicina)
   deleted: (carrying dron1 dron1-izq box21) (box-has box21 medicina)
   added: (at-box box21 refugio5) (free dron1-izq) (person-has person17 medicina)
   goals met: 24 of 31
104. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 24 of 31
105. (pick box20 deposito dron1-izq dron1)
   deleted: (at-box box20 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box20)
   goals met: 24 of 31
106. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 24 of 31
107. (leave box4 refugio5 dron1-der dron1 person26 comida)
   deleted: (carrying dron1 dron1-der box4) (box-has box4 comida)
   added: (at-box box4 refugio5) (free dron1-der) (person-has person26 comida)
   goals met: 25 of 31
108. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 25 of 31
109. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 25 of 31
110. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 25 of 31
111. (leave box20 refugio5 dron1-izq dron1 person26 medicina)
   deleted: (carrying dron1 dron1-izq box20) (box-has box20 medicina)
   added: (at-box box20 refugio5) (free dron1-izq) (person-has person26 medicina)
   goals met: 26 of 31
112. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 26 of 31
113. (pick box19 deposito dron1-izq dron1)
   deleted: (at-box box19 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box19)
   goals met: 26 of 31
114. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 26 of 31
115. (leave box3 refugio14 dron1-der dron1 person9 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio14) (free dron1-der) (person-has person9 comida)
   goals met: 27 of 31
116. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 27 of 31
117. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 27 of 31
118. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 27 of 31
119. (leave box2 refugio14 dron1-der dron1 person27 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio14) (free dron1-der) (person-has person27 comida)
   goals met: 28 of 31
120. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 28 of 31
121. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 28 of 31
122. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 28 of 31
123. (move refugio14 refugio17 dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 refugio17)
   goals met: 28 of 31
124. (leave box1 refugio17 dron1-der dron1 person29 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio17) (free dron1-der) (person-has person29 comida)
   goals met: 29 of 31
125. (leave box19 refugio17 dron1-izq dron1 person29 medicina)
   deleted: (carrying dron1 dron1-izq box19) (box-has box19 medicina)
   added: (at-box box19 refugio17) (free dron1-izq) (person-has person29 medicina)
   goals met: 30 of 31
126. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 30 of 31
127. (pick box18 deposito dron1-der dron1)
   deleted: (at-box box18 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box18)
   goals met: 30 of 31
128. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 30 of 31
129. (leave box18 refugio14 dron1-der dron1 person27 medicina)
   deleted: (carrying dron1 dron1-der box18) (box-has box18 medicina)
   added: (at-box box18 refugio14) (free dron1-der) (person-has person27 medicina)
   goals met: 31 of 31
